[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:21:13
         protected override void OnModelCreating(ModelBuilder modelBuilder)
         {
             // Configuración de Usuario
-            modelBuilder.Entity<Usuario>(entity =>
-            {
-                entity.ToTable("Usuarios");
-        entity.HasKey(e => e.Id);
-                entity.Property(e => e.Correo).IsRequired();
-                entity.Property(e => e.Password).IsRequired();
-            });
+            ;
 
             // Configuración de OperacionPDF

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:23:17
             // Configuración de Usuario
             modelBuilder.Entity<Usuario>(entity =>
             {
-                entity.ToTable("Usuarios");
+                ;
         entity.HasKey(e => e.Id);
                 entity.Property(e => e.Correo).IsRequired();

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:24:9
             modelBuilder.Entity<Usuario>(entity =>
             {
                 entity.ToTable("Usuarios");
-        entity.HasKey(e => e.Id);
+        ;
                 entity.Property(e => e.Correo).IsRequired();
                 entity.Property(e => e.Password).IsRequired();

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:25:17
             {
                 entity.ToTable("Usuarios");
         entity.HasKey(e => e.Id);
-                entity.Property(e => e.Correo).IsRequired();
+                ;
                 entity.Property(e => e.Password).IsRequired();
             });

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:26:17
                 entity.ToTable("Usuarios");
         entity.HasKey(e => e.Id);
                 entity.Property(e => e.Correo).IsRequired();
-                entity.Property(e => e.Password).IsRequired();
+                ;
             });
 

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:30:13
             });
 
             // Configuración de OperacionPDF
-            modelBuilder.Entity<OperacionPDF>(entity =>
-            {
-                 entity.ToTable("operaciones_pdf");
-        entity.HasKey(e => e.Id);
-                entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
-                entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");
-                entity.Property(e => e.FechaOperacion).HasColumnName("fecha_operacion");
-                
-                entity.HasOne<Usuario>()
-                    .WithMany()
-                    .HasForeignKey(e => e.UsuarioId);
-            });
+            ;
 
             // Configuración de DetalleSuscripcion

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:32:18
             // Configuración de OperacionPDF
             modelBuilder.Entity<OperacionPDF>(entity =>
             {
-                 entity.ToTable("operaciones_pdf");
+                 ;
         entity.HasKey(e => e.Id);
                 entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:33:9
             modelBuilder.Entity<OperacionPDF>(entity =>
             {
                  entity.ToTable("operaciones_pdf");
-        entity.HasKey(e => e.Id);
+        ;
                 entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
                 entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:34:17
             {
                  entity.ToTable("operaciones_pdf");
         entity.HasKey(e => e.Id);
-                entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
+                ;
                 entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");
                 entity.Property(e => e.FechaOperacion).HasColumnName("fecha_operacion");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:35:17
                  entity.ToTable("operaciones_pdf");
         entity.HasKey(e => e.Id);
                 entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
-                entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");
+                ;
                 entity.Property(e => e.FechaOperacion).HasColumnName("fecha_operacion");
                 

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:36:17
         entity.HasKey(e => e.Id);
                 entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
                 entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");
-                entity.Property(e => e.FechaOperacion).HasColumnName("fecha_operacion");
+                ;
                 
                 entity.HasOne<Usuario>()

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:38:17
                 entity.Property(e => e.TipoOperacion).HasColumnName("TipoOperacion");
                 entity.Property(e => e.FechaOperacion).HasColumnName("fecha_operacion");
                 
-                entity.HasOne<Usuario>()
-                    .WithMany()
-                    .HasForeignKey(e => e.UsuarioId);
+                ;
             });
 

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:44:12
             });
 
             // Configuración de DetalleSuscripcion
-           modelBuilder.Entity<DetalleSuscripcion>(entity =>
-    {
-        entity.ToTable("detalles_suscripciones");
-        entity.Property(e => e.precio)
-            .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
-        entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
-        entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
-        entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
-        entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
-        entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");
-        
-        entity.HasOne(d => d.Usuario)
-            .WithMany()
-            .HasForeignKey(d => d.UsuarioId);
-            });
+           ;
         }
      

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:46:9
             // Configuración de DetalleSuscripcion
            modelBuilder.Entity<DetalleSuscripcion>(entity =>
     {
-        entity.ToTable("detalles_suscripciones");
+        ;
         entity.Property(e => e.precio)
             .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:47:9
            modelBuilder.Entity<DetalleSuscripcion>(entity =>
     {
         entity.ToTable("detalles_suscripciones");
-        entity.Property(e => e.precio)
-            .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
+        ; // 10 dígitos en total, 2 decimales
         entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:49:9
         entity.ToTable("detalles_suscripciones");
         entity.Property(e => e.precio)
             .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
-        entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
+        ;
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
         entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:50:9
         entity.Property(e => e.precio)
             .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
         entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
-        entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
+        ;
         entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
         entity.Property(e => e.fecha_final).HasColumnName("fecha_final");

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:51:9
             .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
         entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
-        entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
+        ;
         entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
         entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");

[Killed] String mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:51:60
             .HasPrecision(10, 2); // 10 dígitos en total, 2 decimales
         entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
-        entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
+        entity.Property(e => e.fecha_inicio).HasColumnName("");
         entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
         entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");
killedBy: NegocioPDF.Tests.Data.PDFSolutionsContextTests.Context_DebeConfigurarRelacionesCorrectamente

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:52:9
         entity.Property(e => e.UsuarioId).HasColumnName("usuario_id");
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
         entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
-        entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
+        ;
         entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");
         

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:53:9
         entity.Property(e => e.tipo_suscripcion).HasColumnName("tipo_suscripcion");
         entity.Property(e => e.fecha_inicio).HasColumnName("fecha_inicio");
         entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
-        entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");
+        ;
         
         entity.HasOne(d => d.Usuario)

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Data/PDFSolutionsContext.cs:55:9
         entity.Property(e => e.fecha_final).HasColumnName("fecha_final");
         entity.Property(e => e.operaciones_realizadas).HasColumnName("operaciones_realizadas");
         
-        entity.HasOne(d => d.Usuario)
-            .WithMany()
-            .HasForeignKey(d => d.UsuarioId);
+        ;
             });
         }
