[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:13:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AlterColumn<decimal>(
-                name: "precio",
-                table: "detalles_suscripciones",
-                type: "decimal(10,2)",
-                precision: 10,
-                scale: 2,
-                nullable: true,
-                oldClrType: typeof(decimal),
-                oldType: "decimal(18,2)",
-                oldNullable: true);
+            ;
         }
 

[NoCoverage] String mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:16:23
             migrationBuilder.AlterColumn<decimal>(
                 name: "precio",
                 table: "detalles_suscripciones",
-                type: "decimal(10,2)",
+                type: "",
                 precision: 10,
                 scale: 2,

[NoCoverage] Boolean mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:19:27
                 type: "decimal(10,2)",
                 precision: 10,
                 scale: 2,
-                nullable: true,
+                nullable: false,
                 oldClrType: typeof(decimal),
                 oldType: "decimal(18,2)",

[NoCoverage] Boolean mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:22:30
                 nullable: true,
                 oldClrType: typeof(decimal),
                 oldType: "decimal(18,2)",
-                oldNullable: true);
+                oldNullable: false);
         }
 

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:28:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AlterColumn<decimal>(
-                name: "precio",
-                table: "detalles_suscripciones",
-                type: "decimal(18,2)",
-                nullable: true,
-                oldClrType: typeof(decimal),
-                oldType: "decimal(10,2)",
-                oldPrecision: 10,
-                oldScale: 2,
-                oldNullable: true);
+            ;
         }
     }

[NoCoverage] Boolean mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:32:27
                 name: "precio",
                 table: "detalles_suscripciones",
                 type: "decimal(18,2)",
-                nullable: true,
+                nullable: false,
                 oldClrType: typeof(decimal),
                 oldType: "decimal(10,2)",

[NoCoverage] Boolean mutation
PROYECTO_PDF/NegocioPDF/Migrations/20241126065353_UpdatePrecisionForPrecio.cs:37:30
                 oldType: "decimal(10,2)",
                 oldPrecision: 10,
                 oldScale: 2,
-                oldNullable: true);
+                oldNullable: false);
         }
     }
