[Killed] Block removal mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:15:9
         private readonly PDFSolutionsContext _context;
 
         public DetalleSuscripcionRepository(PDFSolutionsContext context)
-        {
-            _context = context;
-        }
+        {}
 
        public DetalleSuscripcion? ObtenerPorUsuarioId(int usuarioId) // Marca el tipo como nullable
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeActualizarTodosLosCampos; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeLanzarException_CuandoSuscripcionNoExiste; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ObtenerPorUsuarioId_DebeRetornarNull_CuandoUsuarioNoExiste

[Killed] Linq method mutation (FirstOrDefault() to First())
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:21:12
 
        public DetalleSuscripcion? ObtenerPorUsuarioId(int usuarioId) // Marca el tipo como nullable
 {
-    return _context.DetallesSuscripcion
-        .Include(d => d.Usuario)
-        .Where(d => d.UsuarioId == usuarioId)
-        .OrderByDescending(d => d.Id)
-        .FirstOrDefault();
+    return _context.DetallesSuscripcion
+        .Include(d => d.Usuario)
+        .Where(d => d.UsuarioId == usuarioId)
+        .OrderByDescending(d => d.Id)
+        .First();
 }
 
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ObtenerPorUsuarioId_DebeRetornarNull_CuandoUsuarioNoExiste

[Survived] Linq method mutation (OrderByDescending() to OrderBy())
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:21:12
 
        public DetalleSuscripcion? ObtenerPorUsuarioId(int usuarioId) // Marca el tipo como nullable
 {
-    return _context.DetallesSuscripcion
-        .Include(d => d.Usuario)
-        .Where(d => d.UsuarioId == usuarioId)
-        .OrderByDescending(d => d.Id)
+    return _context.DetallesSuscripcion
+        .Include(d => d.Usuario)
+        .Where(d => d.UsuarioId == usuarioId)
+        .OrderBy(d => d.Id)
         .FirstOrDefault();
 }

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:23:21
 {
     return _context.DetallesSuscripcion
         .Include(d => d.Usuario)
-        .Where(d => d.UsuarioId == usuarioId)
+        .Where(d => d.UsuarioId != usuarioId)
         .OrderByDescending(d => d.Id)
         .FirstOrDefault();
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeActualizarTodosLosCampos; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ObtenerPorUsuarioId_DebeRetornarNull_CuandoUsuarioNoExiste; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ObtenerPorUsuarioId_DebeRetornarSuscripcion_CuandoExisteUsuario

[Killed] Linq method mutation (FirstOrDefault() to First())
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:30:32
 
 public void ActualizarSuscripcion(DetalleSuscripcion suscripcion)
 {
-    var suscripcionExistente = _context.DetallesSuscripcion
-        .FirstOrDefault(d => d.UsuarioId == suscripcion.UsuarioId);
+    var suscripcionExistente = _context.DetallesSuscripcion
+        .First(d => d.UsuarioId == suscripcion.UsuarioId);
 
     if (suscripcionExistente != null)
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeLanzarException_CuandoSuscripcionNoExiste

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:31:30
 public void ActualizarSuscripcion(DetalleSuscripcion suscripcion)
 {
     var suscripcionExistente = _context.DetallesSuscripcion
-        .FirstOrDefault(d => d.UsuarioId == suscripcion.UsuarioId);
+        .FirstOrDefault(d => d.UsuarioId != suscripcion.UsuarioId);
 
     if (suscripcionExistente != null)
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeActualizarTodosLosCampos; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeLanzarException_CuandoSuscripcionNoExiste

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:33:9
     var suscripcionExistente = _context.DetallesSuscripcion
         .FirstOrDefault(d => d.UsuarioId == suscripcion.UsuarioId);
 
-    if (suscripcionExistente != null)
+    if (suscripcionExistente == null)
     {
           // Actualizar las propiedades específicas de la tabla
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeActualizarTodosLosCampos; NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeLanzarException_CuandoSuscripcionNoExiste

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:42:9
         suscripcionExistente.precio = suscripcion.precio;
         suscripcionExistente.operaciones_realizadas = suscripcion.operaciones_realizadas;
         // Guardar los cambios en la base de datos
-        _context.SaveChanges();
+        ;
     }
     else

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/DetalleSuscripcionRepository.cs:46:9
     }
     else
     {
-        throw new Exception("No se encontró una suscripción para actualizar.");
+        ;
     }
 }
killedBy: NegocioPDF.Tests.DetalleSuscripcionRepositoryTests.ActualizarSuscripcion_DebeLanzarException_CuandoSuscripcionNoExiste; NegocioPDF.Tests.Repositories.DetalleSuscripcionRepositoryDetailedTests.ActualizarSuscripcion_DebeLanzarException_CuandoNoExiste
