[Killed] Block removal mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:16:9
         private readonly PDFSolutionsContext _context;
 
         public OperacionesPDFRepository(PDFSolutionsContext context)
-        {
-            _context = context;
-        }
+        {}
 
         public bool RegistrarOperacionPDF(int usuarioId, string tipoOperacion)
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto

[Survived] Linq method mutation (FirstOrDefault() to First())
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:24:35
         {
             try
             {
-                var suscripcion = _context.DetallesSuscripcion
-                    .FirstOrDefault(d => d.UsuarioId == usuarioId);
+                var suscripcion = _context.DetallesSuscripcion
+                    .First(d => d.UsuarioId == usuarioId);
 
                 if (suscripcion == null)

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:25:42
             try
             {
                 var suscripcion = _context.DetallesSuscripcion
-                    .FirstOrDefault(d => d.UsuarioId == usuarioId);
+                    .FirstOrDefault(d => d.UsuarioId != usuarioId);
 
                 if (suscripcion == null)

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:27:21
                 var suscripcion = _context.DetallesSuscripcion
                     .FirstOrDefault(d => d.UsuarioId == usuarioId);
 
-                if (suscripcion == null)
+                if (suscripcion != null)
                 {
                     return false;
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:32:65
                     return false;
                 }
 
-                if (suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas >= 5)
+                if (suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas < 5)
                 {
                     return false;
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto; NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_DebeActualizarContador_ParaUsuarioBasico

[Killed] Logical mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:32:21
                     return false;
                 }
 
-                if (suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas >= 5)
+                if (suscripcion.tipo_suscripcion == "basico" || suscripcion.operaciones_realizadas >= 5)
                 {
                     return false;

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:44:17
                     FechaOperacion = DateTime.Now
                 };
 
-                _context.OperacionesPDF.Add(operacion);
+                ;
 
                 if (suscripcion.tipo_suscripcion == "basico")
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto; NegocioPDF.Tests.Repositories.RepositoriesDetailedTests.OperacionesPDF_DebeContarOperacionesCorrectamente; OperacionesPDFRepositoryTests.RegistrarOperacionPDF_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:46:21
 
                 _context.OperacionesPDF.Add(operacion);
 
-                if (suscripcion.tipo_suscripcion == "basico")
+                if (suscripcion.tipo_suscripcion != "basico")
                 {
                     suscripcion.operaciones_realizadas++;
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_DebeActualizarContador_ParaUsuarioBasico; NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_NoDebeActualizarContador_ParaUsuarioPremium

[Killed] PostIncrementExpression to PostDecrementExpression mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:48:21
 
                 if (suscripcion.tipo_suscripcion == "basico")
                 {
-                    suscripcion.operaciones_realizadas++;
+                    suscripcion.operaciones_realizadas--;
                     _context.DetallesSuscripcion.Update(suscripcion);
                 }
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_DebeActualizarContador_ParaUsuarioBasico; OperacionesPDFRepositoryTests.RegistrarOperacionPDF_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:48:21
 
                 if (suscripcion.tipo_suscripcion == "basico")
                 {
-                    suscripcion.operaciones_realizadas++;
+                    ;
                     _context.DetallesSuscripcion.Update(suscripcion);
                 }
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_DebeActualizarContador_ParaUsuarioBasico; OperacionesPDFRepositoryTests.RegistrarOperacionPDF_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:49:21
                 if (suscripcion.tipo_suscripcion == "basico")
                 {
                     suscripcion.operaciones_realizadas++;
-                    _context.DetallesSuscripcion.Update(suscripcion);
+                    ;
                 }
 

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:52:17
                     _context.DetallesSuscripcion.Update(suscripcion);
                 }
 
-                _context.SaveChanges();
+                ;
                 return true;
             }
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto; NegocioPDF.Tests.Repositories.RepositoriesDetailedTests.OperacionesPDF_DebeContarOperacionesCorrectamente; OperacionesPDFRepositoryTests.RegistrarOperacionPDF_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion

[Killed] Boolean mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:53:24
                 }
 
                 _context.SaveChanges();
-                return true;
+                return false;
             }
             catch
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.RegistrarOperacionPDF_DebeActualizarContador_ParaUsuarioBasico

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:63:20
 
         public IEnumerable<OperacionPDF> ObtenerOperacionesPorUsuario(int usuarioId)
         {
-            return _context.OperacionesPDF
-                .Where(o => o.UsuarioId == usuarioId)
-                .OrderByDescending(o => o.FechaOperacion)
+            return _context.OperacionesPDF
+                .Where(o => o.UsuarioId == usuarioId)
+                .OrderBy(o => o.FechaOperacion)
                 .ToList();
         }
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ObtenerOperacionesPorUsuario_DebeRetornarListaOrdenada; NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryExtendedTests.ObtenerOperacionesPorUsuario_DebeRetornarOperacionesOrdenadas

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:64:29
         public IEnumerable<OperacionPDF> ObtenerOperacionesPorUsuario(int usuarioId)
         {
             return _context.OperacionesPDF
-                .Where(o => o.UsuarioId == usuarioId)
+                .Where(o => o.UsuarioId != usuarioId)
                 .OrderByDescending(o => o.FechaOperacion)
                 .ToList();
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto; NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ObtenerOperacionesPorUsuario_DebeRetornarListaOrdenada; NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryExtendedTests.ObtenerOperacionesPorUsuario_DebeRetornarOperacionesOrdenadas

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:71:55
 
         public int ContarOperacionesRealizadas(int usuarioId)
         {
-            return _context.OperacionesPDF.Count(o => o.UsuarioId == usuarioId);
+            return _context.OperacionesPDF.Count(o => o.UsuarioId != usuarioId);
         }
 
killedBy: NegocioPDF.Tests.Repositories.OperacionesPDFRepositoryDetailedTests.ContarOperacionesRealizadas_DebeRetornarTotalCorrecto; NegocioPDF.Tests.Repositories.RepositoriesDetailedTests.OperacionesPDF_DebeContarOperacionesCorrectamente; OperacionesPDFRepositoryTests.ContarOperacionesRealizadas_DebeRetornarNumeroCorrectamente

[Killed] Logical mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:84:22
                 return false;
             }
 
-            return !(suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas >= 5);
+            return !(suscripcion.tipo_suscripcion == "basico" || suscripcion.operaciones_realizadas >= 5);
         }
     }
killedBy: OperacionesPDFRepositoryTests.ValidarOperacion_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/OperacionesPDFRepository.cs:84:66
                 return false;
             }
 
-            return !(suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas >= 5);
+            return !(suscripcion.tipo_suscripcion == "basico" && suscripcion.operaciones_realizadas < 5);
         }
     }
killedBy: NegocioPDF.Tests.Repositories.RepositoriesDetailedTests.OperacionesPDF_DebeValidarLimiteOperaciones; OperacionesPDFRepositoryTests.ValidarOperacion_DebeRetornarFalse_CuandoUsuarioAlcanzoLimite; OperacionesPDFRepositoryTests.ValidarOperacion_DebeRetornarTrue_CuandoUsuarioPuedeRealizarOperacion
