[Killed] Block removal mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:13:9
         private readonly PDFSolutionsContext _context;
 
         public UsuarioRepository(PDFSolutionsContext context)
-        {
-            _context = context;
-        }
+        {}
 
         public Usuario? Login(string correo, string password)

[Killed] Linq method mutation (FirstOrDefault() to First())
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:19:20
 
         public Usuario? Login(string correo, string password)
         {
-            return _context.Usuarios
-                .FirstOrDefault(u => u.Correo == correo && u.Password == password);
+            return _context.Usuarios
+                .First(u => u.Correo == correo && u.Password == password);
         }
 
killedBy: UsuarioRepositoryExtendedTests.Login_DebeRetornarNull_CuandoCredencialesInvalidas; UsuarioRepositoryTests.Login_DebeRetornarNull_CuandoCredencialesSonIncorrectas

[Killed] Logical mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:20:38
         public Usuario? Login(string correo, string password)
         {
             return _context.Usuarios
-                .FirstOrDefault(u => u.Correo == correo && u.Password == password);
+                .FirstOrDefault(u => u.Correo == correo || u.Password == password);
         }
 
killedBy: UsuarioRepositoryExtendedTests.Login_DebeRetornarNull_CuandoCredencialesInvalidas; UsuarioRepositoryTests.Login_DebeRetornarNull_CuandoCredencialesSonIncorrectas

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:20:38
         public Usuario? Login(string correo, string password)
         {
             return _context.Usuarios
-                .FirstOrDefault(u => u.Correo == correo && u.Password == password);
+                .FirstOrDefault(u => u.Correo != correo && u.Password == password);
         }
 

[Killed] Negate expression
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:26:17
         public void RegistrarUsuario(Usuario usuario)
         {
             // Validar datos requeridos
-            if (string.IsNullOrWhiteSpace(usuario.Nombre))
+            if (!(string.IsNullOrWhiteSpace(usuario.Nombre)))
             {
                 throw new InvalidOperationException("El nombre es requerido.");

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:28:17
             // Validar datos requeridos
             if (string.IsNullOrWhiteSpace(usuario.Nombre))
             {
-                throw new InvalidOperationException("El nombre es requerido.");
+                ;
             }
             
killedBy: NegocioPDF.Tests.Models.ModelValidationTests.Usuario_NoDebePermitirDatosVacios; UsuarioRepositoryExtendedTests.RegistrarUsuario_DebeValidarNombreVacio

[Killed] Negate expression
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:31:17
                 throw new InvalidOperationException("El nombre es requerido.");
             }
             
-            if (string.IsNullOrWhiteSpace(usuario.Correo))
+            if (!(string.IsNullOrWhiteSpace(usuario.Correo)))
             {
                 throw new InvalidOperationException("El correo es requerido.");

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:33:17
             
             if (string.IsNullOrWhiteSpace(usuario.Correo))
             {
-                throw new InvalidOperationException("El correo es requerido.");
+                ;
             }
             

[Killed] Negate expression
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:36:17
                 throw new InvalidOperationException("El correo es requerido.");
             }
             
-            if (string.IsNullOrWhiteSpace(usuario.Password))
+            if (!(string.IsNullOrWhiteSpace(usuario.Password)))
             {
                 throw new InvalidOperationException("La contraseña es requerida.");

[Killed] String mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:36:17
                 throw new InvalidOperationException("El correo es requerido.");
             }
             
-            if (string.IsNullOrWhiteSpace(usuario.Password))
+            if ((usuario.Password!=null))
             {
                 throw new InvalidOperationException("La contraseña es requerida.");

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:38:17
             
             if (string.IsNullOrWhiteSpace(usuario.Password))
             {
-                throw new InvalidOperationException("La contraseña es requerida.");
+                ;
             }
 

[Killed] Equality mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:42:44
             }
 
             // Verificar si el correo ya existe
-            if (_context.Usuarios.Any(u => u.Correo == usuario.Correo))
+            if (_context.Usuarios.Any(u => u.Correo != usuario.Correo))
             {
                 throw new InvalidOperationException("El correo electrónico ya está registrado.");
killedBy: NegocioPDF.Tests.Models.ModelValidationTests.Usuario_NoDebePermitirDuplicados

[Killed] Linq method mutation (Any() to All())
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:42:17
             }
 
             // Verificar si el correo ya existe
-            if (_context.Usuarios.Any(u => u.Correo == usuario.Correo))
+            if (_context.Usuarios.All(u => u.Correo == usuario.Correo))
             {
                 throw new InvalidOperationException("El correo electrónico ya está registrado.");

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:44:17
             // Verificar si el correo ya existe
             if (_context.Usuarios.Any(u => u.Correo == usuario.Correo))
             {
-                throw new InvalidOperationException("El correo electrónico ya está registrado.");
+                ;
             }
 
killedBy: NegocioPDF.Tests.Models.ModelValidationTests.Usuario_NoDebePermitirDuplicados; UsuarioRepositoryTests.RegistrarUsuario_DebeLanzarException_CuandoCorreoYaExiste

[Killed] Negate expression
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:47:17
                 throw new InvalidOperationException("El correo electrónico ya está registrado.");
             }
 
-            if (_context.Database.IsInMemory())
+            if (!(_context.Database.IsInMemory()))
             {
                 // Omite transacciones si estás usando In-Memory

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:50:17
             if (_context.Database.IsInMemory())
             {
                 // Omite transacciones si estás usando In-Memory
-                _context.Usuarios.Add(usuario);
+                ;
                 _context.SaveChanges();
 
killedBy: NegocioPDF.Tests.Models.ModelValidationTests.Usuario_DebePermitirDatosValidos

[Survived] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:51:17
             {
                 // Omite transacciones si estás usando In-Memory
                 _context.Usuarios.Add(usuario);
-                _context.SaveChanges();
+                ;
 
                 // Crear suscripción básica para el usuario

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:54:17
                 _context.SaveChanges();
 
                 // Crear suscripción básica para el usuario
-                CrearSuscripcionBasica(usuario);
+                ;
                 return;
             }

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:55:17
 
                 // Crear suscripción básica para el usuario
                 CrearSuscripcionBasica(usuario);
-                return;
+                ;
             }
 

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:61:17
             using var transaction = _context.Database.BeginTransaction();
             try
             {
-                _context.Usuarios.Add(usuario);
+                ;
                 _context.SaveChanges();
 

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:67:17
                 // Crear suscripción básica para el usuario
                 CrearSuscripcionBasica(usuario);
 
-                transaction.Commit();
+                ;
             }
             catch

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:71:17
             }
             catch
             {
-                transaction.Rollback();
+                ;
                 throw;
             }

[NoCoverage] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:72:17
             catch
             {
                 transaction.Rollback();
-                throw;
+                ;
             }
         }

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:88:13
                 operaciones_realizadas = 0
             };
 
-            _context.DetallesSuscripcion.Add(suscripcion);
+            ;
             _context.SaveChanges();
         }

[Killed] Statement mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:89:13
             };
 
             _context.DetallesSuscripcion.Add(suscripcion);
-            _context.SaveChanges();
+            ;
         }
 

[Killed] Block removal mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:93:9
         }
 
         public IEnumerable<Usuario> ObtenerUsuarios()
-        {
-            return _context.Usuarios.ToList();
-        }
+        {}
 
         public Usuario? ObtenerUsuarioPorId(int idUsuario)
killedBy: UsuarioRepositoryExtendedTests.ObtenerUsuarios_DebeRetornarListaCompleta; UsuarioRepositoryExtendedTests.ObtenerUsuarios_DebeRetornarListaVacia_CuandoNoHayUsuarios; UsuarioRepositoryTests.ObtenerUsuarios_DebeRetornarTodosLosUsuarios

[Survived] Block removal mutation
PROYECTO_PDF/NegocioPDF/Repositories/UsuarioRepository.cs:98:9
         }
 
         public Usuario? ObtenerUsuarioPorId(int idUsuario)
-        {
-            return _context.Usuarios.Find(idUsuario);
-        }
+        {}
     }
 }
